### pandas 1강

import pandas as pd

In [2]:
data_frame = pd.read_csv('data/Example1-3.csv')

In [4]:
data_frame.head()

   Tree   E   W   S   N
0     1  66  77  76  72
1     2  53  63  66  60
2     3  57  58  64  56
3     4  29  38  36  41
4     5  32  36  35  32

In [5]:
data_frame.tail(4)

    Tree   E   W   S   N
24    25  36  31  39  39
25    26  34  40  37  50
26    27  37  50  39  43
27    28  54  43  57  48

In [7]:
type(data_frame.Tree)
#데이터셋의 컬럼 type 은 Series

pandas.core.series.Series

In [8]:
list_tmp = [1,2,3]

In [9]:
list_tmp

[1, 2, 3]

In [10]:
s1 = pd.core.series.Series( [1,2,3] )

In [12]:
s2 = pd.core.series.Series( ['one','two','three'] )

In [14]:
 pd.DataFrame(data=dict(num = s1, word = s2))

   num   word
0    1    one
1    2    two
2    3  three

### Pandas 2강

In [17]:
!conda list | grep pandas

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [3]:
import pandas as pd

In [20]:
df = pd.read_csv('data/Example1-3.csv')

In [22]:
df.head()

   Tree   E   W   S   N
0     1  66  77  76  72
1     2  53  63  66  60
2     3  57  58  64  56
3     4  29  38  36  41
4     5  32  36  35  32

In [ ]:
#txt 파일도 쉼표 구분 시 csv로 불러올 수 있음
#df2 = pd.read_csv('data/Example1-3.txt')

#txt 파일도 쉼표 구분 시 csv로 불러올 수 있음
#df3 = pd.read_csv('data/Example1-3.txt', delimiter = '\t')

In [23]:
df = pd.read_csv('data/Example1-3.csv', header = None)

In [26]:
df.head()

      0   1   2   3   4
0  Tree   E   W   S   N
1     1  66  77  76  72
2     2  53  63  66  60
3     3  57  58  64  56
4     4  29  38  36  41

In [27]:
df.columns = ['Tree', 'E', 'W', 'S', 'N']

In [ ]:
df.head()

In [32]:
df = pd.read_csv('data/Example1-3.csv', header = None, names = ['Tree', 'E', 'W', 'S', 'N'])

In [33]:
df.head()

   Tree   E   W   S   N
0  Tree   E   W   S   N
1     1  66  77  76  72
2     2  53  63  66  60
3     3  57  58  64  56
4     4  29  38  36  41

In [38]:
friend_dict_list = [
    {'name': 'John', 'age': 25, 'job': 'student'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

In [39]:
df = pd.DataFrame(friend_dict_list)

In [40]:
df.head()
#데이터 넣은 순서대로 들어가는 것이 아님

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [41]:
df = df[['name', 'age', 'job']]

In [46]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [47]:
from collections import OrderedDict
#KEY의 순서를 보장하기 위한 ORDERED DICTIONARY

In [49]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher']),
    ]
)

In [51]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
#from_dict이 함수

In [52]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [54]:
friend_list = [
    ['John', 25, 'student'],
    ['Nate', 30, 'teacher']
]

In [55]:
column_name = ['name', 'age', 'job']

In [58]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [59]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [1]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [4]:
df = pd.DataFrame.from_dict(dict(friend_list))
#df = pd.DataFrame.from_items(friend_list)

In [6]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [7]:
###Write DataFrame to File

In [16]:
friend_list = [
    ['name', ['John', 'Jenny', 'nate']],
    ['age', [20, 30, 40]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [17]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   40    teacher

In [15]:
df.to_csv('data/friend_list_from_df.csv')

In [19]:
df.to_csv('friend_list_from_df.csv', header = True, index = True)

In [20]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

In [22]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

In [26]:
friend_list = [
    ['name',['John', None, 'nate']],
    ['age', [20, None, 30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_dict(dict(friend_list))

In [28]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [31]:
df.to_csv('friend_list_from_df.csv', na_rep = '-', index = None)
#na를 -로 채워서 저장

### Select Row

In [1]:
import pandas as pd
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer', 'teacher']]
]
dict(friend_list)

{'name': ['John', 'Jenny', 'Nate'],
 'age': [20, 30, 30],
 'job': ['student', 'developer', 'teacher']}

In [7]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [19]:
df[0:3]

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [20]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [71]:
df.loc[0:2]

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [73]:
df.iloc[[0,2]]

      0   1        2
0  John  20  student
2  Nate  30  teacher

In [67]:
df.iloc[[0,2], :]

      0   1        2
0  John  20  student
2  Nate  30  teacher

In [70]:
df.iloc[0:2, :]

       0   1          2
0   John  20    student
1  Jenny  30  developer

In [10]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df_filtered = df[df.age > 25]

In [23]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [39]:
df_filtered = df.query('age > 25')

In [26]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [42]:
df.query('age >= 30 and age < 50')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [32]:
df_filtered = df[(df.age > 25) & (df.name == 'Nate')]

In [33]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [68]:
df_filtered = df.query('name == @['Nate']') #이건 왜 안됨?

SyntaxError: invalid syntax (<ipython-input-68-e83ea3ce3bab>, line 1)

In [51]:
friend_list = [['John', 20, 'student'], ['Jenny', 30, 'developer'], ['Nate', 30, 'teacher']]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [64]:
df.loc[0:2, :] #왜? 0:2하면 0,1,2 다나옴?

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [76]:
#by column name
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [78]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [79]:
df.filter(items = ['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [80]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [84]:
df.filter(like = 'a', axis=1) #0 - row / 1 - column

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [94]:
df.filter(regex = 'b$', axis=1) #b로 끝나는 문자

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [103]:
#Drop rows
friend_dict_list = [{'age' : 20, 'job' : 'student'},
                   {'age' : 30, 'job' : 'developer'},
                   {'age' : 30, 'job' : 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jeny', 'Nate'])

In [97]:
df.head()

      age        job
John   20    student
Jeny   30  developer
Nate   30    teacher

In [98]:
df.drop(['John', 'Nate'])

      age        job
Jeny   30  developer

In [99]:
df

      age        job
John   20    student
Jeny   30  developer
Nate   30    teacher

In [104]:
df = df.drop(['John', 'Nate'])

In [105]:
df

      age        job
Jeny   30  developer

In [108]:
#Drop row in place
friend_dict_list = [{'age':20, 'job':'student'},
                   {'age':30, 'job':'developer'},
                   {'age':30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [110]:
df.drop(['John', 'Nate'], inplace = True) #df에 저장됨

In [112]:
#by row id (index number)
friend_dict_list = [{'name':'Jone', 'age':20, 'job':'student'},
                   {'name':'Jenny', 'age':30, 'job':'developer'},
                   {'name':'Nate', 'age':30, 'job':'developer'}]
df = pd.DataFrame(friend_dict_list)

In [113]:
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30  developer   Nate

In [116]:
#by Column value
friend_dict_list = [{'name':'Jone','age':20, 'job':'student'},
                   {'name':'Jenny', 'age':30, 'job':'developer'},
                   {'name':'Name','age':30, 'job':'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Name

In [118]:
df = df[df.age != 30]

In [119]:
df

   age      job  name
0   20  student  Jone

In [122]:
#Add Column / Update Column
friend_dict_list = [{'name':'Jone', 'age':15, 'job':'student'},
                   {'name':'Jenny', 'age':30, 'job':'developer'},
                   {'name':'Name','age':30, 'job':'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Name   30    teacher

In [130]:
df['salary'] = 0
df.gender = None #이건 실행 안됨, 즉 이미 변수가 있을 때만 실행될 것
df.salary = 1

In [131]:
df

    name  age        job  salary
0   Jone   15    student       1
1  Jenny   30  developer       1
2   Name   30    teacher       1

In [13]:
#Add new column derived from existing value
friend_dict_list = [{'name':'Jone', 'age':15, 'job':'student'},
                   {'name':'Jenny', 'age':30, 'job':'developer'},
                   {'name':'Nate', 'age':30, 'job':'teacer'}]
df = pd.DataFrame(friend_dict_list, columns = ['name','age','job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30     teacer

In [14]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [136]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30     teacer    yes

In [137]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                   {'name':'Jenny', 'midterm':85, 'final':80},
                   {'name':'Nate', 'midterm':10, 'final':30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [138]:
df['total'] = df['midterm'] + df['final']

In [139]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [141]:
df['average'] = df['total'] / 2

In [142]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [145]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [147]:
#How to use apply function
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [148]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [149]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

In [28]:
#info extraction using df.apply
data_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}]
df = pd.DataFrame(data_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [29]:
def extract_year(row):
    return row.split('-')[0]

In [30]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [31]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [32]:
#Passing keyword parameter to apply function
def extract_year(year, current_year):
    return current_year - int(year)

In [33]:
df['age'] = df['year'].apply(extract_year, current_year = 2018)

In [34]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [35]:
#Passing multiple keyword parameter to apply function
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [36]:
df['introduce'] = df['age'].apply(get_introduce, prefix = "I am ", suffix = ' years old')

In [37]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

In [38]:
#Passing multiple columns to apply function
def get_introduce2(row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

df.introduce = df.apply(get_introduce2, axis=1) #use all column(axis=1)

In [39]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

In [40]:
#How to use map function
date_list = [{'yyyy-mm-dd':'2000-06-27'},
            {'yyyy-mm-dd':'2002-09-24'},
            {'yyyy-mm-dd':'2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [41]:
def extract_year(row):
    return row.split('-')[0]

In [42]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [43]:
#map 특징 잘 보기
job_list = [{'age':20, 'job':'student'},
           {'age':30, 'job':'developer'},
           {'age':30, 'job':'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [44]:
df.job = df.job.map({"student":1, "developer":2, "teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [45]:
#Applymap
x_y = [{'x': 5.5, 'y':-5.6},
      {'x':5.2, 'y':5.5,
      'x':-1.6, 'y':-4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -1.6 -4.5

In [47]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -2.0 -4.0

In [2]:
import pandas as pd
import numpy as np

#Add Row
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                   {'name':'Jenny', 'midterm':85, 'final':80},
                   {'name':'Nate', 'midterm':10, 'final':30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [3]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [4]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [5]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

In [6]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [7]:
groupby_major = df.groupby('major')

In [9]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [12]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print() #공백 줄

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [13]:
print(group) #그냥 마지막 내용이 들어감

     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [15]:
#Group object to dataframe
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [17]:
groupby_sex = df.groupby('sex')

In [19]:
for name, group in groupby_sex:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [20]:
df_sex_cnt = pd.DataFrame({'count':groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      6
1    male      5

In [21]:
#Drop Duplicate
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [23]:
#Check is there is dulicated row
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [24]:
df = df.drop_duplicates()

In [25]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [26]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [27]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [30]:
df.drop_duplicates(['name'], keep='last') #뒤에 행을 남기기

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [31]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [46]:
#How to manage none value?
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [33]:
#how to check if there is Null or NaN
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [35]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [36]:
#How to fill Null or NaN
tmp = df
tmp['age'] = tmp['age'].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [47]:
#Fill missing age with median age for each group (teacher, student)
df["age"].fillna(df.groupby("job")["age"].transform("median"), inplace = True)

In [49]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [50]:
#Unique
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [51]:
print( df.job.unique() )

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

In [53]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
dentist              1
developer            1
basketball player    1
Name: job, dtype: int64

In [54]:
#Concatenate two dataframe
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [57]:
#pd.concat
frames = [df1, df2]
result = pd.concat(frames, ignore_index = True)

In [58]:
#df.append
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
result = df1.append(df2, ignore_index=True)

In [59]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [60]:
#pd.concat 옆으로
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
result = pd.concat([df1, df2], axis=1, ignore_index=True)

result

In [62]:
#Concatenate two list as a dataframe
label = [1,2,3,4,5]
prediction = [1,2,3,4,5]

comparison = pd.DataFrame(
    {'label':label,
    'prediction':prediction})

comparison

   label  prediction
0      1           1
1      2           2
2      3           3
3      4           4
4      5           5